app/controllers/session_controller.rb

  def create
    user = User.find_by user_name: params[:session][:user_name].downcase
---
SELECT  `users`.* FROM `users` WHERE `users`.`user_name` = 'addmin' ORDER BY `users`.`id` ASC LIMIT 1