app/controllers/user_controller.rb

INSERT INTO `users` (`user_name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('', '', '', '2018-11-21 18:44:20', '2018-11-21 18:44:20')
---
  def create
    # binding.pry
    @user = User.new user_params
    if @user.save